   - [#  20] CRP isTriangle: 
--------------------------------------------------------------------------------
   6:     An implementation that classifies triangles.
   7:     '''
   8:     
   9:     class Type(Enum):
- 10:         INVALID = 0
+ 10:         INVALID = 1
  11:         SCALENE = 1
  12:         EQUILATERAL = 2
  13:         ISOSCELES = 3
  14:     
--------------------------------------------------------------------------------
[0.00932 s] killed by test14 (test_mutationAdequate.MutationAdequateTest)

   - [#  21] CRP isTriangle: 
--------------------------------------------------------------------------------
   7:     '''
   8:     
   9:     class Type(Enum):
  10:         INVALID = 0
- 11:         SCALENE = 1
+ 11:         SCALENE = 2
  12:         EQUILATERAL = 2
  13:         ISOSCELES = 3
  14:     
  15:     @staticmethod
--------------------------------------------------------------------------------
[0.00880 s] killed by test10 (test_mutationAdequate.MutationAdequateTest)

   - [#  22] CRP isTriangle: 
--------------------------------------------------------------------------------
   8:     
   9:     class Type(Enum):
  10:         INVALID = 0
  11:         SCALENE = 1
- 12:         EQUILATERAL = 2
+ 12:         EQUILATERAL = 3
  13:         ISOSCELES = 3
  14:     
  15:     @staticmethod
  16:     def classify(a, b, c):
--------------------------------------------------------------------------------
[0.00859 s] killed by test1 (test_mutationAdequate.MutationAdequateTest)

   - [#  23] CRP isTriangle: 
--------------------------------------------------------------------------------
   9:     class Type(Enum):
  10:         INVALID = 0
  11:         SCALENE = 1
  12:         EQUILATERAL = 2
- 13:         ISOSCELES = 3
+ 13:         ISOSCELES = 4
  14:     
  15:     @staticmethod
  16:     def classify(a, b, c):
  17:         '''
--------------------------------------------------------------------------------
[0.00910 s] killed by test11 (test_mutationAdequate.MutationAdequateTest)

   - [#  24] CRP isTriangle: 
--------------------------------------------------------------------------------
  17:         '''
  18:         This static method does the actual classification of a triangle, given the lengths
  19:         of its three sides.
  20:         '''
- 21:         if (a <= 0 or b <= 0 or c <= 0):
+ 21:         if (a <= 1 or b <= 0 or c <= 0):
  22:             return Triangle.Type.INVALID
  23:         
  24:         trian = 0
  25:         
--------------------------------------------------------------------------------
[0.00794 s] survived

   - [#  25] CRP isTriangle: 
--------------------------------------------------------------------------------
  17:         '''
  18:         This static method does the actual classification of a triangle, given the lengths
  19:         of its three sides.
  20:         '''
- 21:         if (a <= 0 or b <= 0 or c <= 0):
+ 21:         if (a <= 0 or b <= 1 or c <= 0):
  22:             return Triangle.Type.INVALID
  23:         
  24:         trian = 0
  25:         
--------------------------------------------------------------------------------
[0.00772 s] survived

   - [#  26] CRP isTriangle: 
--------------------------------------------------------------------------------
  17:         '''
  18:         This static method does the actual classification of a triangle, given the lengths
  19:         of its three sides.
  20:         '''
- 21:         if (a <= 0 or b <= 0 or c <= 0):
+ 21:         if (a <= 0 or b <= 0 or c <= 1):
  22:             return Triangle.Type.INVALID
  23:         
  24:         trian = 0
  25:         
--------------------------------------------------------------------------------
[0.00774 s] survived

   - [#  27] CRP isTriangle: 
--------------------------------------------------------------------------------
  20:         '''
  21:         if (a <= 0 or b <= 0 or c <= 0):
  22:             return Triangle.Type.INVALID
  23:         
- 24:         trian = 0
+ 24:         trian = 1
  25:         
  26:         if a == b:
  27:             trian += 1
  28:         if a == c:
--------------------------------------------------------------------------------
[0.00816 s] survived

   - [#  28] CRP isTriangle: 
--------------------------------------------------------------------------------
  23:         
  24:         trian = 0
  25:         
  26:         if a == b:
- 27:             trian += 1
+ 27:             trian += 2
  28:         if a == c:
  29:             trian += 2
  30:         if b == c:
  31:             trian += 3
--------------------------------------------------------------------------------
[0.00803 s] survived

   - [#  29] CRP isTriangle: 
--------------------------------------------------------------------------------
  25:         
  26:         if a == b:
  27:             trian += 1
  28:         if a == c:
- 29:             trian += 2
+ 29:             trian += 3
  30:         if b == c:
  31:             trian += 3
  32:         
  33:         if trian == 0:
--------------------------------------------------------------------------------
[0.00771 s] survived

   - [#  30] CRP isTriangle: 
--------------------------------------------------------------------------------
  27:             trian += 1
  28:         if a == c:
  29:             trian += 2
  30:         if b == c:
- 31:             trian += 3
+ 31:             trian += 4
  32:         
  33:         if trian == 0:
  34:             if (a + b <= c or a + c <= b or b + c <= a):
  35:                 return Triangle.Type.INVALID
--------------------------------------------------------------------------------
[0.00791 s] survived

   - [#  31] CRP isTriangle: 
--------------------------------------------------------------------------------
  29:             trian += 2
  30:         if b == c:
  31:             trian += 3
  32:         
- 33:         if trian == 0:
+ 33:         if trian == 1:
  34:             if (a + b <= c or a + c <= b or b + c <= a):
  35:                 return Triangle.Type.INVALID
  36:             else:
  37:                 return Triangle.Type.SCALENE
--------------------------------------------------------------------------------
[0.00820 s] survived

   - [#  32] CRP isTriangle: 
--------------------------------------------------------------------------------
  35:                 return Triangle.Type.INVALID
  36:             else:
  37:                 return Triangle.Type.SCALENE
  38:         
- 39:         if trian > 3:
+ 39:         if trian > 4:
  40:             return Triangle.Type.EQUILATERAL
  41:         
  42:         if (trian == 1 and a + b > c):
  43:             return Triangle.Type.ISOSCELES
--------------------------------------------------------------------------------
[0.00777 s] survived

   - [#  33] CRP isTriangle: 
--------------------------------------------------------------------------------
  38:         
  39:         if trian > 3:
  40:             return Triangle.Type.EQUILATERAL
  41:         
- 42:         if (trian == 1 and a + b > c):
+ 42:         if (trian == 2 and a + b > c):
  43:             return Triangle.Type.ISOSCELES
  44:         elif (trian == 2 and a + c > b):
  45:             return Triangle.Type.ISOSCELES
  46:         elif (trian == 3 and b + c > a):
--------------------------------------------------------------------------------
[0.00779 s] survived

   - [#  34] CRP isTriangle: 
--------------------------------------------------------------------------------
  40:             return Triangle.Type.EQUILATERAL
  41:         
  42:         if (trian == 1 and a + b > c):
  43:             return Triangle.Type.ISOSCELES
- 44:         elif (trian == 2 and a + c > b):
+ 44:         elif (trian == 3 and a + c > b):
  45:             return Triangle.Type.ISOSCELES
  46:         elif (trian == 3 and b + c > a):
  47:             return Triangle.Type.ISOSCELES
  48:         
--------------------------------------------------------------------------------
[0.00888 s] survived

   - [#  35] CRP isTriangle: 
--------------------------------------------------------------------------------
  42:         if (trian == 1 and a + b > c):
  43:             return Triangle.Type.ISOSCELES
  44:         elif (trian == 2 and a + c > b):
  45:             return Triangle.Type.ISOSCELES
- 46:         elif (trian == 3 and b + c > a):
+ 46:         elif (trian == 4 and b + c > a):
  47:             return Triangle.Type.ISOSCELES
  48:         
  49:         return Triangle.Type.INVALID
--------------------------------------------------------------------------------
[0.00783 s] survived

   - [#  36] DDL isTriangle: 
--------------------------------------------------------------------------------
  11:         SCALENE = 1
  12:         EQUILATERAL = 2
  13:         ISOSCELES = 3
  14:     
- 15:     @staticmethod
- 16:     def classify(a, b, c):
+ 15:     def classify(\
+ 16:         a, b, c):
  17:         '''
  18:         This static method does the actual classification of a triangle, given the lengths
  19:         of its three sides.
  20:         '''
--------------------------------------------------------------------------------
[0.00826 s] survived
